# coding=utf-8
# Постарайтесь использовать то, что мы прошли на уроке при решении этого ДЗ,
# вспомните про zip(), map(), lambda, посмотрите где лучше с ними, а где они излишни!

# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"


def whois(name, age, city):
    print('{}, {} год(а), проживает в городе {}'.format(name, age, city))


whois('Василий', '21', 'Москва')
